Repository: goucem-meriem-malak/Sawt
Catalog: APP/lib/l10n/app_*.arb
Languages: ar

source: Hello
ar: مرحباً

# welcome
source: Welcome to Saawt!
ar: مرحباً بك في صوت!

source: Welcome back
ar: مرحباً بعودتك

# create_new_account
source: Create a new account
ar: إنشاء حساب جديد

source: Sign in
ar: تسجيل الدخول

source: Create account
ar: إنشاء حساب

source: Full name
ar: الاسم الكامل

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Sign up
ar: تسجيل

# dont_have_account
source: Don't have an account?
ar: ليس لديك حساب؟

# already_have_account
source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Create an account
ar: إنشاء حساب

# terms_and_privacy
source: By signing in/signing up, you agree to the Terms and Privacy Policy.
ar: بتسجيل الدخول أو إنشاء حساب، فإنك توافق على الشروط وسياسة الخصوصية.

source: Alert
ar: تنبيه

# check_email_pwd
source: Check the email and password (≥ 6 chars)
ar: تحقق من البريد الإلكتروني وكلمة المرور (٦ أحرف على الأقل)

source: Sign-in failed
ar: فشل تسجيل الدخول

source: Sign-up failed
ar: فشل إنشاء الحساب

source: Error
ar: خطأ

source: Done
ar: تم

source: Account created.
ar: تم إنشاء الحساب بنجاح.

# tagline
source: Reconnecting families during crisis
ar: لم شمل العائلات في أوقات الأزمات

source: Report Missing Person
ar: الإبلاغ عن شخص مفقود

# report_missing_subtitle
source: Someone is missing and you need help finding them
ar: هل هناك شخص مفقود وتحتاج المساعدة في العثور عليه؟

source: Report Found Person
ar: الإبلاغ عن شخص تم العثور عليه

# report_found_subtitle
source: You found someone who might be missing
ar: لقد وجدت شخصاً قد يكون مفقوداً

source: Potential Matches
ar: التطابقات المحتملة

# analyzing_faces
source: Analyzing faces and finding matches...
ar: جاري تحليل الصور والبحث عن تطابقات...

# no_matches
source: No matches found yet
ar: لم يتم العثور على تطابقات حتى الآن

# notify_when_matches
source: We'll notify you when potential matches are detected
ar: سنخطرك عند العثور على تطابق محتمل

source: Refresh
ar: تحديث

source: Potential Match
ar: تطابق محتمل

# confidence_percent
source: {percent}% confidence
ar: نسبة الثقة: {percent}%

source: Missing Person
ar: الشخص المفقود

source: Found Person
ar: الشخص الذي تم العثور عليه

source: Unknown
ar: غير معروف

source: Age
ar: العمر: {value}

# matched_on
source: Matched {date}
ar: تم التطابق في {date}

source: Not a Match
ar: ليس تطابقاً

source: Confirm Match
ar: تأكيد التطابق

source: Pending
ar: قيد الانتظار

source: Confirmed
ar: مؤكد

source: Rejected
ar: مرفوض

source: Investigating
ar: قيد التحقيق

source: today
ar: اليوم

source: yesterday
ar: أمس

# days_ago
source: {count} days ago
ar: منذ {count} أيام

# errorLoadMatches
source: Failed to load matches: {error}
ar: فشل في تحميل التطابقات: {error}

source: Refreshed
ar: تم التحديث

# matchesUpdated
source: Matches updated successfully
ar: تم تحديث قائمة التطابقات بنجاح

# confirmMatchTitle
source: Confirm Match
ar: تأكيد التطابق

# confirmMatchMessage
source: Are you sure you want to confirm this match?
ar: هل أنت متأكد أنك تريد تأكيد هذا التطابق؟

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Match Confirmed
ar: تم تأكيد التطابق

source: Conversation opened.
ar: تم فتح المحادثة

# errorConfirmMatch
source: Failed to confirm match: {error}
ar: فشل في تأكيد التطابق: {error}

# rejectMatchTitle
source: Reject Match
ar: رفض التطابق

# rejectMatchMessage
source: Are you sure this is not a correct match? This action cannot be undone.
ar: هل أنت متأكد أن هذا التطابق غير صحيح؟ هذا الإجراء لا يمكن التراجع عنه.

source: Reject
ar: رفض

source: Match Rejected
ar: تم رفض التطابق

# matchMarkedIncorrect
source: This match has been marked as incorrect
ar: تم تحديد أن هذا التطابق غير صحيح

# errorRejectMatch
source: Failed to reject match: {error}
ar: فشل في رفض التطابق: {error}

# filterMatchesTitle
source: Filter Matches
ar: تصفية التطابقات

source: Pending Review
ar: في انتظار المراجعة

source: Under Investigation
ar: قيد التحقيق

source: All
ar: الكل

source: Groups
ar: المجموعات

source: Muted
ar: المحادثات المكتومة

source: Messages
ar: الرسائل

# noConversations
source: No conversations yet
ar: لا توجد محادثات بعد

source: User
ar: مستخدم

# noMessages
source: No messages yet
ar: لا توجد رسائل بعد

source: Group chat
ar: دردشة جماعية

# typeMessage
source: Type a message...
ar: اكتب رسالة...

source: Chat
ar: محادثة

source: No matches found
ar: لم يتم العثور على أي تطابق

# redirectingToHome
source: Redirecting you to the home page…
ar: سيتم تحويلك إلى الصفحة الرئيسية...

source: Help & Feedback
ar: المساعدة والتغذية الراجعة

source: Subject
ar: الموضوع

# subjectHint
source: Enter a short title…
ar: أدخل عنواناً قصيراً...

# subjectValidation
source: Please enter a subject
ar: يرجى إدخال موضوع

source: Message
ar: الرسالة

# messageHint
source: Describe your issue or feedback…
ar: صف مشكلتك أو أرسل ملاحظاتك...

# messageValidation
source: Please enter a message
ar: يرجى إدخال رسالة

source: Send
ar: إرسال

source: Opening email
ar: جاري فتح البريد الإلكتروني

# creatingDraft
source: Creating a draft message…
ar: يتم إنشاء مسودة الرسالة...

source: Email app not available
ar: لا يوجد تطبيق بريد إلكتروني متاح

# detailsCopied
source: Details copied to clipboard. Paste into your email app.
ar: تم نسخ التفاصيل إلى الحافظة. يمكنك لصقها في تطبيق بريدك.

# noUserSignedIn
source: No user is signed in.
ar: لا يوجد مستخدم مسجَّل الدخول

source: DB Error
ar: خطأ في قاعدة البيانات

# failedToLoadProfile
source: Failed to load profile: {error}
ar: فشل تحميل الملف الشخصي: {error}

source: Edit Profile
ar: تعديل الملف الشخصي

source: Save
ar: حفظ

source: Saved
ar: تم الحفظ

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# failedToUploadImage
source: Failed to upload image: {error}
ar: فشل رفع الصورة: {error}

source: No Image
ar: لا توجد صورة

# setProfilePhotoFirst
source: Set a profile photo first.
ar: قم بتعيين صورة للملف الشخصي أولاً

source: Profile
ar: الملف الشخصي

source: Statistics
ar: الإحصائيات

source: Missing Reports
ar: بلاغات المفقودين

source: Found Reports
ar: بلاغات الموجودين

source: Successful Matches
ar: التطابقات الناجحة

source: Active Cases
ar: الحالات النشطة

source: Quick Actions
ar: إجراءات سريعة

source: View Missing Reports
ar: عرض بلاغات المفقودين

# seeAllMissingReports
source: See all your missing person reports
ar: عرض جميع بلاغات المفقودين

source: View Found Reports
ar: عرض بلاغات الموجودين

# seeAllFoundReports
source: See all your found person reports
ar: عرض جميع بلاغات الموجودين

source: Report History
ar: سجل البلاغات

# viewReportHistory
source: View your complete reporting history
ar: عرض السجل الكامل للبلاغات

source: Settings
ar: الإعدادات

source: Notifications
ar: الإشعارات

# manageNotifications
source: Manage your notification preferences
ar: إدارة إعدادات الإشعارات

source: Privacy & Security
ar: الخصوصية والأمان

# controlPrivacy
source: Control your privacy settings
ar: إدارة إعدادات الخصوصية

# askSupport
source: Ask support or share feedback
ar: اطلب الدعم أو أرسل ملاحظاتك

source: About
ar: حول

# appInformation
source: App information and version
ar: معلومات التطبيق والإصدار

source: Logout
ar: تسجيل الخروج

source: Notification Settings
ar: إعدادات الإشعارات

source: New message notifications
ar: إشعارات الرسائل الجديدة

source: New match notifications
ar: إشعارات التطابقات الجديدة

# appAnnouncements
source: App announcements & updates
ar: إعلانات وتحديثات التطبيق

source: Close
ar: إغلاق

# privacyAndSecurity
source: Privacy & Security
ar: الخصوصية والأمان

# showReportsPublicly
source: Show my reports publicly (without contact info)
ar: عرض بلاغاتي بشكل عام (بدون بيانات الاتصال)

# allowContactAfterMatch
source: Allow others to contact me after a match
ar: السماح للآخرين بالاتصال بي بعد التطابق

source: Save & Close
ar: حفظ وإغلاق

source: About SAWT
ar: حول SAWT

# sawtApp
source: SAWT - Family Reconnection App
ar: SAWT - تطبيق لم شمل العائلات

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

# sawtDescription
source: SAWT helps reconnect families and locate missing persons during wartime or crisis situations using advanced face recognition technology.
ar: يساعد SAWT على لم شمل العائلات والعثور على المفقودين خلال الحروب أو الأزمات باستخدام تقنية التعرف على الوجه.

# sawtMission
source: Our mission is to bring hope and reunite families when they need it most.
ar: مهمتنا هي إدخال الأمل ولم شمل العائلات في أصعب الأوقات.

source: Profile photo
ar: صورة الملف الشخصي

source: My Missing Reports
ar: بلاغاتي عن المفقودين

# noMissingReports
source: No missing reports yet
ar: لا توجد بلاغات عن مفقودين بعد

# createMissingReportHint
source: Create a missing report from Home.
ar: يمكنك إنشاء بلاغ مفقود من الصفحة الرئيسية.

source: My Found Reports
ar: بلاغاتي عن الموجودين

# noFoundReports
source: No found reports yet
ar: لا توجد بلاغات عن موجودين بعد

# createFoundReportHint
source: Create a found report from Home.
ar: يمكنك إنشاء بلاغ موجود من الصفحة الرئيسية.

source: My History Reports
ar: سجل البلاغات

# noReports
source: No reports yet
ar: لا توجد بلاغات بعد

# historyHint
source: Your missing & found reports will appear here.
ar: ستظهر هنا جميع بلاغاتك عن المفقودين والموجودين.

source: Last seen location
ar: آخر موقع شوهد فيه

source: Last seen date
ar: تاريخ آخر مشاهدة

source: Description
ar: الوصف

source: Reporter name
ar: اسم المبلّغ

source: Reporter phone
ar: هاتف المبلّغ

source: Reporter email
ar: بريد المبلّغ

source: Estimated age
ar: العمر التقريبي

source: Location
ar: الموقع

source: Found date
ar: تاريخ العثور

source: Condition
ar: الحالة

source: Hospital info
ar: معلومات المستشفى

source: Finder name
ar: اسم الشخص الذي وجد

source: Finder phone
ar: هاتف الشخص الذي وجد

source: No match yet
ar: لا يوجد تطابق بعد

source: Missing
ar: مفقود

source: Found
ar: موجود

# todayAt
source: today {hour}:{minute}
ar: اليوم {hour}:{minute}

# daysAgo
source: {days} days ago
ar: منذ {days} يوم

source: Reports
ar: البلاغات

source: Search by name…
ar: ابحث بالاسم...

source: No reports found
ar: لا توجد بلاغات

source: Waiting...
ar: في الانتظار...

source: Searching
ar: جاري البحث...

source: Loading model…
ar: جاري تحميل النموذج...

source: Processing local images…
ar: جاري معالجة الصور المحلية...

# retrievingSupabase
source: Retrieving from Database…
ar: جاري الجلب من Supabase...

source: ❌ Report not found
ar: ❌ لم يتم العثور على البلاغ

source: ✅ Match found
ar: ✅ تم العثور على تطابق

# noMatchSupabase
source: ❌ No match in Supabase
ar: ❌ لا يوجد تطابق في Database

source: Not signed in
ar: غير مسجَّل الدخول

# signInToChat
source: Please sign in to start a conversation.
ar: يرجى تسجيل الدخول لبدء محادثة

source: Unavailable
ar: غير متاح

# noOwner
source: This report has no owner linked.
ar: لا يوجد مالك مرتبط بهذا البلاغ

source: Info
ar: معلومة

# ownReport
source: This is your own report.
ar: هذا البلاغ يخصك

# couldNotOpenChat
source: Could not open chat: {error}
ar: تعذر فتح المحادثة: {error}

# reportFoundPersonTitle
source: Report Found Person
ar: الإبلاغ عن شخص عُثر عليه

# reportMissingPersonTitle
source: Report Missing Person
ar: الإبلاغ عن شخص مفقود

source: Select Image Source
ar: اختر مصدر الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# infoMessage
source: Please provide clear photos and accurate information to help us identify the found person.
ar: يرجى تقديم صور واضحة ومعلومات دقيقة لمساعدتنا على التعرف على الشخص الذي تم العثور عليه.

# photosLabel
source: Photos *
ar: الصور *

# personInfoLabel
source: Person Information
ar: معلومات الشخص

source: Full Name (optional)
ar: الاسم الكامل (اختياري)

# fullNameHint
source: Enter person's name if known
ar: أدخل اسم الشخص إن كان معروفاً

# estimatedAgeLabel
source: Estimated Age *
ar: العمر التقريبي *

# estimatedAgeHint
source: Enter estimated age
ar: أدخل العمر التقريبي

source: Invalid age
ar: العمر غير صالح

# requiredField
source: Required
ar: هذا الحقل مطلوب

# foundLocationLabel
source: Found Location *
ar: مكان العثور *

# foundLocationHint
source: City, area, or address
ar: المدينة أو المنطقة أو العنوان

# foundDateLabel
source: Found Date *
ar: تاريخ العثور *

# conditionLabel
source: Condition
ar: الحالة

source: Alive
ar: حي

source: Injured
ar: مصاب

source: Deceased
ar: متوفى

# descriptionLabel
source: Description
ar: الوصف

# descriptionHint
source: Physical features, clothing...
ar: الملامح الجسدية، الملابس...

# contactInfoLabel
source: Your Contact Information
ar: معلومات الاتصال الخاصة بك

# yourNameLabel
source: Your Name *
ar: اسمك *

# yourNameHint
source: Enter your name
ar: أدخل اسمك

# phoneLabel
source: Phone Number *
ar: رقم الهاتف *

# phoneHint
source: Enter your phone number
ar: أدخل رقم هاتفك

# invalidPhone
source: Invalid phone number
ar: رقم الهاتف غير صالح

source: Email (optional)
ar: البريد الإلكتروني (اختياري)

# emailHint
source: Enter your email
ar: أدخل بريدك الإلكتروني

# hospitalNotesLabel
source: Hospital/Notes
ar: مستشفى/ملاحظات

# hospitalNotesHint
source: Hospital info or additional notes
ar: أدخل معلومات المستشفى أو أي ملاحظات إضافية

source: Submit Report
ar: إرسال البلاغ

# snackCompleteFields
source: Please complete all required fields
ar: يرجى إكمال جميع الحقول المطلوبة

# snackSignInFirst
source: Please sign in first
ar: يرجى تسجيل الدخول أولاً

# snackSuccessFound
source: Found report submitted successfully
ar: تم إرسال بلاغ العثور بنجاح

# snackSuccessMissing
source: Missing report submitted successfully
ar: تم إرسال بلاغ المفقود بنجاح

# snackError
source: Error saving report
ar: حدث خطأ أثناء حفظ البلاغ

# snackSupabaseError
source: Supabase error: {message}
ar: خطأ في Supabase: {message}
